Documents/ИнвойсПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнвойсПродажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервироватьТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВДороге.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВДороге</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДороги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДороги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РезервыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидДороги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДороги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыИнвойсаПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыИнвойсаПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсПродажи/Ext/ObjectModule.bsl
// © Primus1C  13.12.2023  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоНовый() ИЛИ Лев(Номер,2) <> Фирма.Префикс Тогда
	//УстановитьНовыйНомер(Фирма.Префикс + "-" + формат(дата, "ДФ=yyyyMMdd") + "-");
	//КонецЕсли;   
	
	Сумма = Товары.Итог("Сумма") + Доставка;
	Количество = Товары.Итог("Количество");
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);  

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//Если ЗначениеЗаполнено(Контрагент.Префикс) Тогда
	//	Префикс = СокрЛП(Контрагент.Префикс);  
	//КонецЕсли;  
	
	Префикс = Фирма.Префикс + "-" + формат(дата, "ДФ=yyyyMMdd") + "-";

КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ)

	Если РезервироватьТовар Тогда
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Отказ = Истина;	
			Сообщить(НСтр("ru = 'Не заполнен склад резервирования!'; en = 'The Store not filled in !'"));
		КонецЕсли;
	КонецЕсли;  
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьВозможностьПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// © Primus1C  22.07.2026  НАЧАЛО ►

	ТаблицаТоваров = ТаблицаТоваров();
	
	// РН ТоварыВДороге Приход  
	
	Движения.ТоварыВДороге.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из ТаблицаТоваров Цикл
		Движение = Движения.ТоварыВДороге.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.ВидДороги 		= Перечисления.ВидДороги.Резерв;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Количество 	= ТекСтрокаТовары.Количество;
	КонецЦикла;  
	
	// РН РезервыТовара
	
	Если РезервироватьТовар Тогда
		Движения.РезервыТовара.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из ТаблицаТоваров Цикл
			Движение = Движения.РезервыТовара.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			Движение.Заказ 			= Ссылка;   
			Движение.Склад          = Склад;
			Движение.Фирма          = Фирма;
			Движение.Количество 	= ТекСтрокаТовары.Количество;
		КонецЦикла;  
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	// РС СтатусыИнвойсовПродажи
	
	ТекущийСтатус 	= РаботаСИнвойсами.ПолучитьСтатусИнвойсаПродажи(Ссылка);
	Статусы 		= Перечисления.СтатусыИнвойсаПродажи;
	КемИзменено 	= КемИзмененоИзДопСвойств(ДополнительныеСвойства);
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Отменен, Ссылка, КемИзменено);	

	ИначеЕсли ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если ПометкаУдаления Тогда
			Если ТекущийСтатус.Состояние <> Статусы.Отменен Тогда 
				РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Отменен, Ссылка, КемИзменено);
			КонецЕсли;
		Иначе
			Если ТекущийСтатус.Состояние = Статусы.Отменен Тогда
				РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Зарегистрирован, Ссылка, КемИзменено);
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ДокументИзмененПередПроведением(ДополнительныеСвойства) Тогда
			РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Изменен, Ссылка, КемИзменено);
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийСтатус.Состояние) ИЛИ ТекущийСтатус.Состояние = Статусы.Отменен Тогда
			РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Зарегистрирован, Ссылка, КемИзменено);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// © Primus1C  22.07.2026  НАЧАЛО ►

Функция ТаблицаТоваров()
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ИнвойсПродажиТовары.Номенклатура КАК Номенклатура,
	             |	СУММА(ИнвойсПродажиТовары.Количество) КАК Количество,
	             |	СУММА(ИнвойсПродажиТовары.Сумма) КАК Сумма
	             |ИЗ
	             |	Документ.ИнвойсПродажи.Товары КАК ИнвойсПродажиТовары
	             |ГДЕ
	             |	ИнвойсПродажиТовары.Ссылка = &Ссылка
	             |	И ИнвойсПродажиТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ИнвойсПродажиТовары.Номенклатура";
	
	Возврат Запр.Выполнить().Выгрузить();

КонецФункции 

// © Primus1C  ОКОНЧАНИЕ ◄

Процедура ОбработкаУдаленияПроведения(Отказ)

	Статусы = Перечисления.СтатусыИнвойсаПродажи;
	//РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Отменен, Ссылка);	
    КемИзменено = КемИзмененоИзДопСвойств(ДополнительныеСвойства);
	РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(Ссылка, Статусы.Отменен, Ссылка, КемИзменено);	

КонецПроцедуры 

Функция КемИзмененоИзДопСвойств(ДопСвойства)
	
	Если ДопСвойства.Свойство("КемИзменено") Тогда 
		Если ЗначениеЗаполнено(ДопСвойства.КемИзменено) Тогда
			Возврат ДопСвойства.КемИзменено;  
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		Возврат гоПользователь().Сотрудник;
	КонецЕсли;
	
КонецФункции

// Определяет, нужно ли при проведении устанавливать статус "Изменен".
//
// Параметры:
//  ДопСвойства - Структура - дополнительные свойства документа.
//
// Возвращаемое значение:
//  Булево - Истина, если документ изменен интерактивно или вызовом API.
//
Функция ДокументИзмененПередПроведением(ДопСвойства)
	
	Если ДопСвойства.Свойство("ИзмененИнтерактивно") И ДопСвойства.ИзмененИнтерактивно Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДопСвойства.Свойство("ИзмененВызовомAPI") И ДопСвойства.ИзмененВызовомAPI Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// © Primus1C  ОКОНЧАНИЕ ◄
